Tekla Open API Reference for Tekla Structures 2025
AnalysisModelConnectivityRule.Linkage1 Property
 The linkage 1 of the connectivity rule.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int Linkage1 { get; set; }
Public Property Linkage1 As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AnalysisModelConnectivityRule Class
Tekla.Structures.Analysis Namespace